tap "anomalyco/tap"
tap "armmbed/formulae"
tap "candid82/brew"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "denisidoro/tools"
tap "hashicorp/tap"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "warrensbox/tap"
tap "yqrashawn/goku"
brew "aria2"
brew "zstd"
brew "azure-cli"
brew "bash"
brew "libgit2"
brew "bat"
brew "libpng"
brew "glib"
brew "cairo"
brew "cmake"
brew "freetds"
brew "giflib"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "webp"
brew "php"
brew "composer"
brew "coreutils"
brew "ddrescue"
brew "docker", link: false
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fprobe"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "harfbuzz"
brew "helm"
brew "hyperfine"
brew "jpeg"
brew "jq"
brew "openjdk"
brew "kafka"
brew "keyring"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "librsvg"
brew "libslirp"
brew "luv"
brew "make"
brew "mas"
brew "midnight-commander"
brew "minikube"
brew "neovim"
brew "node"
brew "nvm"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "poetry"
brew "poppler"
brew "portaudio"
brew "python-setuptools"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "sbt"
brew "ta-lib"
brew "tere"
brew "tesseract"
brew "thefuck"
brew "tmux"
brew "unbound"
brew "virtualenv"
brew "vite"
brew "yarn"
brew "zookeeper"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@29"
brew "denisidoro/tools/docpars"
brew "osx-cross/arm/arm-none-eabi-binutils"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "warrensbox/tap/tfswitch"
cask "cscreen"
cask "ngrok"
cask "podman-desktop"
cask "qlgradle"
cask "qlmarkdown"
mas "Amphetamine", id: 937984704
mas "Binaural", id: 946812450
mas "GarageBand", id: 682658836
mas "HP", id: 1474276998
mas "iHosts", id: 1102004240
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "one sec", id: 1532875441
mas "OneCalendar", id: 1238379385
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Steam Link", id: 1246969117
mas "The Unarchiver", id: 425424353
mas "Ultimate Guitar - Chords & Tabs", id: 1479045460
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
uv "basedpyright"
uv "langgraph-cli[inmem]"
uv "mypy"
uv "pyrefly"
uv "python-lsp-server[all]"
uv "ruff"
uv "ty"
npm "@biomejs/biome"
npm "corepack"
npm "openclaw"
npm "ts-node"
npm "typescript"
