tap "denisidoro/tools"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "glib"
brew "icu4c@78"
brew "bash-language-server"
brew "boost"
brew "cmake"
brew "krb5"
brew "cups"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "git-delta"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "go"
brew "harfbuzz"
brew "jq"
brew "marksman"
brew "openai-whisper"
brew "zip"
brew "openjdk@17"
brew "openssl@1.1"
brew "python@3.11"
brew "qemu"
brew "tere"
brew "zoxide"
brew "yt-dlp"
brew "denisidoro/tools/docpars"
brew "yakitrak/yakitrak/obsidian-cli"
cargo "docpars"
uv "basedpyright"
uv "nano-pdf"
